Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Yusuf Ali.tmx
Source language: ar
Languages: en

source: فاكهين بما آتاهم ربهم ووقاهم ربهم عذاب الجحيم
en: Enjoying the (Bliss) which their Lord hath bestowed on them, and their Lord shall deliver them from the Penalty of the Fire.

source: كلوا واشربوا هنيئا بما كنتم تعملون
en: (To them will be said:) "Eat and drink ye, with profit and health, because of your (good) deeds."

source: متكئين على سرر مصفوفة وزوجناهم بحور عين
en: They will recline (with ease) on Thrones (of dignity) arranged in ranks; and We shall join them to Companions, with beautiful big and lustrous eyes.

source: والذين آمنوا واتبعتهم ذريتهم بإيمان ألحقنا بهم ذريتهم وما ألتناهم من عملهم من شيء كل امرئ بما كسب رهين
en: And those who believe and whose families follow them in Faith,- to them shall We join their families: Nor shall We deprive them (of the fruit) of aught of their works: (Yet) is each individual in pledge for his deeds.

source: وأمددناهم بفاكهة ولحم مما يشتهون
en: And We shall bestow on them, of fruit and meat, anything they shall desire.

source: يتنازعون فيها كأسا لا لغو فيها ولا تأثيم
en: They shall there exchange, one with another, a (loving) cup free of frivolity, free of all taint of ill.

source: ويطوف عليهم غلمان لهم كأنهم لؤلؤ مكنون
en: Round about them will serve, (devoted) to them, young male servants (handsome) as Pearls well-guarded.

source: قالوا إنا كنا قبل في أهلنا مشفقين
en: They will say: "Aforetime, we were not without fear for the sake of our people.

source: فمن الله علينا ووقانا عذاب السموم
en: "But Allah has been good to us, and has delivered us from the Penalty of the Scorching Wind.

source: إنا كنا من قبل ندعوه إنه هو البر الرحيم
en: "Truly, we did call unto Him from of old: truly it is He, the Beneficent, the Merciful!"

source: فذكر فما أنت بنعمت ربك بكاهن ولا مجنون
en: Therefore proclaim thou the praises (of thy Lord): for by the Grace of thy Lord, thou art no (vulgar) soothsayer, nor art thou one possessed.

source: أم يقولون شاعر نتربص به ريب المنون
en: Or do they say:- "A Poet! we await for him some calamity (hatched) by Time!"

source: قل تربصوا فإني معكم من المتربصين
en: Say thou: "Await ye!- I too will wait along with you!"

source: أم تأمرهم أحلامهم بهذا أم هم قوم طاغون
en: Is it that their faculties of understanding urge them to this, or are they but a people transgressing beyond bounds?

source: أم يقولون تقوله بل لا يؤمنون
en: Or do they say, "He fabricated the (Message)"? Nay, they have no faith!

source: فليأتوا بحديث مثله إن كانوا صادقين
en: Let them then produce a recital like unto it,- If (it be) they speak the truth!

source: أم خلقوا من غير شيء أم هم الخالقون
en: Were they created of nothing, or were they themselves the creators?

source: أم خلقوا السماوات والأرض بل لا يوقنون
en: Or did they create the heavens and the earth? Nay, they have no firm belief.

source: أم عندهم خزائن ربك أم هم المصيطرون
en: Or are the Treasures of thy Lord with them, or are they the managers (of affairs)?

source: أم لهم سلم يستمعون فيه فليأت مستمعهم بسلطان مبين
en: Or have they a ladder, by which they can (climb up to heaven and) listen (to its secrets)? Then let (such a) listener of theirs produce a manifest proof.

source: أم له البنات ولكم البنون
en: Or has He only daughters and ye have sons?

source: أم تسألهم أجرا فهم من مغرم مثقلون
en: Or is it that thou dost ask for a reward, so that they are burdened with a load of debt?-

source: أم عندهم الغيب فهم يكتبون
en: Or that the Unseen in it their hands, and they write it down?

source: أم يريدون كيدا فالذين كفروا هم المكيدون
en: Or do they intend a plot (against thee)? But those who defy Allah are themselves involved in a Plot!

source: أم لهم إله غير الله سبحان الله عما يشركون
en: Or have they a god other than Allah? Exalted is Allah far above the things they associate with Him!

source: وإن يروا كسفا من السماء ساقطا يقولوا سحاب مركوم
en: Were they to see a piece of the sky falling (on them), they would (only) say: "Clouds gathered in heaps!"

source: فذرهم حتى يلاقوا يومهم الذي فيه يصعقون
en: So leave them alone until they encounter that Day of theirs, wherein they shall (perforce) swoon (with terror),-

source: يوم لا يغني عنهم كيدهم شيئا ولا هم ينصرون
en: The Day when their plotting will avail them nothing and no help shall be given them.

source: وإن للذين ظلموا عذابا دون ذلك ولكن أكثرهم لا يعلمون
en: And verily, for those who do wrong, there is another punishment besides this: But most of them understand not.

source: واصبر لحكم ربك فإنك بأعيننا وسبح بحمد ربك حين تقوم
en: Now await in patience the command of thy Lord: for verily thou art in Our eyes: and celebrate the praises of thy Lord the while thou standest forth,

source: ومن الليل فسبحه وإدبار النجوم
en: And for part of the night also praise thou Him,- and at the retreat of the stars!

source: والنجم إذا هوى
en: By the Star when it goes down,-

source: ما ضل صاحبكم وما غوى
en: Your Companion is neither astray nor being misled.

source: وما ينطق عن الهوى
en: Nor does he say (aught) of (his own) Desire.

source: إن هو إلا وحي يوحى
en: It is no less than inspiration sent down to him:

source: علمه شديد القوى
en: He was taught by one Mighty in Power,

source: ذو مرة فاستوى
en: Endued with Wisdom: for he appeared (in stately form);

source: وهو بالأفق الأعلى
en: While he was in the highest part of the horizon:

source: ثم دنا فتدلى
en: Then he approached and came closer,

source: فكان قاب قوسين أو أدنى
en: And was at a distance of but two bow-lengths or (even) nearer;

source: فأوحى إلى عبده ما أوحى
en: So did (Allah) convey the inspiration to His Servant- (conveyed) what He (meant) to convey.

source: ما كذب الفؤاد ما رأى
en: The (Prophet's) (mind and) heart in no way falsified that which he saw.

source: أفتمارونه على ما يرى
en: Will ye then dispute with him concerning what he saw?

source: ولقد رآه نزلة أخرى
en: For indeed he saw him at a second descent,

source: عند سدرة المنتهى
en: Near the Lote-tree beyond which none may pass:

source: عندها جنة المأوى
en: Near it is the Garden of Abode.

source: إذ يغشى السدرة ما يغشى
en: Behold, the Lote-tree was shrouded (in mystery unspeakable!)

source: ما زاغ البصر وما طغى
en: (His) sight never swerved, nor did it go wrong!

source: لقد رأى من آيات ربه الكبرى
en: For truly did he see, of the Signs of his Lord, the Greatest!

source: أفرأيتم اللات والعزى
en: Have ye seen Lat. and 'Uzza,

source: ومناة الثالثة الأخرى
en: And another, the third (goddess), Manat?

source: ألكم الذكر وله الأنثى
en: What! for you the male sex, and for Him, the female?

source: تلك إذا قسمة ضيزى
en: Behold, such would be indeed a division most unfair!

source: إن هي إلا أسماء سميتموها أنتم وآباؤكم ما أنزل الله بها من سلطان إن يتبعون إلا الظن وما تهوى الأنفس ولقد جاءهم من ربهم الهدى
en: These are nothing but names which ye have devised,- ye and your fathers,- for which Allah has sent down no authority (whatever). They follow nothing but conjecture and what their own souls desire!- Even though there has already come to them Guidance from their Lord!

source: أم للإنسان ما تمنى
en: Nay, shall man have (just) anything he hankers after?

source: فلله الآخرة والأولى
en: But it is to Allah that the End and the Beginning (of all things) belong.

source: وكم من ملك في السماوات لا تغني شفاعتهم شيئا إلا من بعد أن يأذن الله لمن يشاء ويرضى
en: How many-so-ever be the angels in the heavens, their intercession will avail nothing except after Allah has given leave for whom He pleases and that he is acceptable to Him.

source: إن الذين لا يؤمنون بالآخرة ليسمون الملائكة تسمية الأنثى
en: Those who believe not in the Hereafter, name the angels with female names.

source: وما لهم به من علم إن يتبعون إلا الظن وإن الظن لا يغني من الحق شيئا
en: But they have no knowledge therein. They follow nothing but conjecture; and conjecture avails nothing against Truth.

source: فأعرض عن من تولى عن ذكرنا ولم يرد إلا الحياة الدنيا
en: Therefore shun those who turn away from Our Message and desire nothing but the life of this world.

source: ذلك مبلغهم من العلم إن ربك هو أعلم بمن ضل عن سبيله وهو أعلم بمن اهتدى
en: That is as far as knowledge will reach them. Verily thy Lord knoweth best those who stray from His Path, and He knoweth best those who receive guidance.

source: ولله ما في السماوات وما في الأرض ليجزي الذين أساءوا بما عملوا ويجزي الذين أحسنوا بالحسنى
en: Yea, to Allah belongs all that is in the heavens and on earth: so that He rewards those who do evil, according to their deeds, and He rewards those who do good, with what is best.

source: الذين يجتنبون كبائر الإثم والفواحش إلا اللمم إن ربك واسع المغفرة هو أعلم بكم إذ أنشأكم من الأرض وإذ أنتم أجنة في بطون أمهاتكم فلا تزكوا أنفسكم هو أعلم بمن اتقى
en: Those who avoid great sins and shameful deeds, only (falling into) small faults,- verily thy Lord is ample in forgiveness. He knows you well when He brings you out of the earth, And when ye are hidden in your mothers' wombs. Therefore justify not yourselves: He knows best who it is that guards against evil.

source: أفرأيت الذي تولى
en: Seest thou one who turns back,

source: وأعطى قليلا وأكدى
en: Gives a little, then hardens (his heart)?

source: أعنده علم الغيب فهو يرى
en: What! Has he knowledge of the Unseen so that he can see?

source: أم لم ينبأ بما في صحف موسى
en: Nay, is he not acquainted with what is in the Books of Moses-

source: وإبراهيم الذي وفى
en: And of Abraham who fulfilled his engagements?-

source: ألا تزر وازرة وزر أخرى
en: Namely, that no bearer of burdens can bear the burden of another;

source: وأن ليس للإنسان إلا ما سعى
en: That man can have nothing but what he strives for;

source: وأن سعيه سوف يرى
en: That (the fruit of) his striving will soon come in sight:

source: ثم يجزاه الجزاء الأوفى
en: Then will he be rewarded with a reward complete;

source: وأن إلى ربك المنتهى
en: That to thy Lord is the final Goal;

source: وأنه هو أضحك وأبكى
en: That it is He Who granteth Laughter and Tears;

source: وأنه هو أمات وأحيا
en: That it is He Who granteth Death and Life;

source: وأنه خلق الزوجين الذكر والأنثى
en: That He did create in pairs,- male and female,

source: من نطفة إذا تمنى
en: From a seed when lodged (in its place);

source: وأن عليه النشأة الأخرى
en: That He hath promised a Second Creation (Raising of the Dead);

source: وأنه هو أغنى وأقنى
en: That it is He Who giveth wealth and satisfaction;

source: وأنه هو رب الشعرى
en: That He is the Lord of Sirius (the Mighty Star);

source: وأنه أهلك عادا الأولى
en: And that it is He Who destroyed the (powerful) ancient 'Ad (people),

source: وثمود فما أبقى
en: And the Thamud nor gave them a lease of perpetual life.

source: وقوم نوح من قبل إنهم كانوا هم أظلم وأطغى
en: And before them, the people of Noah, for that they were (all) most unjust and most insolent transgressors,

source: والمؤتفكة أهوى
en: And He destroyed the Overthrown Cities (of Sodom and Gomorrah).

source: فغشاها ما غشى
en: So that (ruins unknown) have covered them up.

source: فبأي آلاء ربك تتمارى
en: Then which of the gifts of thy Lord, (O man,) wilt thou dispute about?

source: هذا نذير من النذر الأولى
en: This is a Warner, of the (series of) Warners of old!

source: أزفت الآزفة
en: The (Judgment) ever approaching draws nigh:

source: ليس لها من دون الله كاشفة
en: No (soul) but Allah can lay it bare.

source: أفمن هذا الحديث تعجبون
en: Do ye then wonder at this recital?

source: وتضحكون ولا تبكون
en: And will ye laugh and not weep,-

source: وأنتم سامدون
en: Wasting your time in vanities?

source: فاسجدوا لله واعبدوا
en: But fall ye down in prostration to Allah, and adore (Him)!

source: اقتربت الساعة وانشق القمر
en: The Hour (of Judgment) is nigh, and the moon is cleft asunder.

source: وإن يروا آية يعرضوا ويقولوا سحر مستمر
en: But if they see a Sign, they turn away, and say, "This is (but) transient magic."

source: وكذبوا واتبعوا أهواءهم وكل أمر مستقر
en: They reject (the warning) and follow their (own) lusts but every matter has its appointed time.

source: ولقد جاءهم من الأنباء ما فيه مزدجر
en: There have already come to them Recitals wherein there is (enough) to check (them),

source: حكمة بالغة فما تغن النذر
en: Mature wisdom;- but (the preaching of) Warners profits them not.

source: فتول عنهم يوم يدع الداع إلى شيء نكر
en: Therefore, (O Prophet,) turn away from them. The Day that the Caller will call (them) to a terrible affair,

source: خشعا أبصارهم يخرجون من الأجداث كأنهم جراد منتشر
en: They will come forth,- their eyes humbled - from (their) graves, (torpid) like locusts scattered abroad,

source: مهطعين إلى الداع يقول الكافرون هذا يوم عسر
en: Hastening, with eyes transfixed, towards the Caller!- "Hard is this Day!", the Unbelievers will say.

source: كذبت قبلهم قوم نوح فكذبوا عبدنا وقالوا مجنون وازدجر
en: Before them the People of Noah rejected (their messenger): they rejected Our servant, and said, "Here is one possessed!", and he was driven out.

source: فدعا ربه أني مغلوب فانتصر
en: Then he called on his Lord: "I am one overcome: do Thou then help (me)!"

source: ففتحنا أبواب السماء بماء منهمر
en: So We opened the gates of heaven, with water pouring forth.

source: وفجرنا الأرض عيونا فالتقى الماء على أمر قد قدر
en: And We caused the earth to gush forth with springs, so the waters met (and rose) to the extent decreed.

source: وحملناه على ذات ألواح ودسر
en: But We bore him on an (Ark) made of broad planks and caulked with palm-fibre:

source: تجري بأعيننا جزاء لمن كان كفر
en: She floats under our eyes (and care): a recompense to one who had been rejected (with scorn)!

source: ولقد تركناها آية فهل من مدكر
en: And We have left this as a Sign (for all time): then is there any that will receive admonition?

source: فكيف كان عذابي ونذر
en: But how (terrible) was My Penalty and My Warning?

source: ولقد يسرنا القرآن للذكر فهل من مدكر
en: And We have indeed made the Qur'an easy to understand and remember: then is there any that will receive admonition?

source: كذبت عاد فكيف كان عذابي ونذر
en: The 'Ad (people) (too) rejected (Truth): then how terrible was My Penalty and My Warning?

source: إنا أرسلنا عليهم ريحا صرصرا في يوم نحس مستمر
en: For We sent against them a furious wind, on a Day of violent Disaster,

source: تنزع الناس كأنهم أعجاز نخل منقعر
en: Plucking out men as if they were roots of palm-trees torn up (from the ground).

source: كذبت ثمود بالنذر
en: The Thamud (also) rejected (their) Warners.

source: فقالوا أبشرا منا واحدا نتبعه إنا إذا لفي ضلال وسعر
en: For they said: "What! a man! a Solitary one from among ourselves! shall we follow such a one? Truly should we then be straying in mind, and mad!

source: أألقي الذكر عليه من بيننا بل هو كذاب أشر
en: "Is it that the Message is sent to him, of all people amongst us? Nay, he is a liar, an insolent one!"

source: سيعلمون غدا من الكذاب الأشر
en: Ah! they will know on the morrow, which is the liar, the insolent one!

source: إنا مرسلو الناقة فتنة لهم فارتقبهم واصطبر
en: For We will send the she-camel by way of trial for them. So watch them, (O Salih), and possess thyself in patience!

source: ونبئهم أن الماء قسمة بينهم كل شرب محتضر
en: And tell them that the water is to be divided between them: Each one's right to drink being brought forward (by suitable turns).

source: فنادوا صاحبهم فتعاطى فعقر
en: But they called to their companion, and he took a sword in hand, and hamstrung (her).

source: إنا أرسلنا عليهم صيحة واحدة فكانوا كهشيم المحتظر
en: For We sent against them a single Mighty Blast, and they became like the dry stubble used by one who pens cattle.

source: كذبت قوم لوط بالنذر
en: The people of Lut rejected (his) warning.

source: إنا أرسلنا عليهم حاصبا إلا آل لوط نجيناهم بسحر
en: We sent against them a violent Tornado with showers of stones, (which destroyed them), except Lut's household: them We delivered by early Dawn,-

source: نعمة من عندنا كذلك نجزي من شكر
en: As a Grace from Us: thus do We reward those who give thanks.

source: ولقد أنذرهم بطشتنا فتماروا بالنذر
en: And (Lut) did warn them of Our Punishment, but they disputed about the Warning.

source: ولقد راودوه عن ضيفه فطمسنا أعينهم فذوقوا عذابي ونذر
en: And they even sought to snatch away his guests from him, but We blinded their eyes. (They heard:) "Now taste ye My Wrath and My Warning."

source: ولقد صبحهم بكرة عذاب مستقر
en: Early on the morrow an abiding Punishment seized them:

source: فذوقوا عذابي ونذر
en: "So taste ye My Wrath and My Warning."

source: ولقد جاء آل فرعون النذر
en: To the People of Pharaoh, too, aforetime, came Warners (from Allah).

source: كذبوا بآياتنا كلها فأخذناهم أخذ عزيز مقتدر
en: The (people) rejected all Our Signs; but We seized them with such Penalty (as comes) from One Exalted in Power, able to carry out His Will.

source: أكفاركم خير من أولئكم أم لكم براءة في الزبر
en: Are your Unbelievers, (O Quraish), better than they? Or have ye an immunity in the Sacred Books?

source: أم يقولون نحن جميع منتصر
en: Or do they say: "We acting together can defend ourselves"?

source: سيهزم الجمع ويولون الدبر
en: Soon will their multitude be put to flight, and they will show their backs.

source: بل الساعة موعدهم والساعة أدهى وأمر
en: Nay, the Hour (of Judgment) is the time promised them (for their full recompense): And that Hour will be most grievous and most bitter.

source: إن المجرمين في ضلال وسعر
en: Truly those in sin are the ones straying in mind, and mad.

source: يوم يسحبون في النار على وجوههم ذوقوا مس سقر
en: The Day they will be dragged through the Fire on their faces, (they will hear:) "Taste ye the touch of Hell!"

source: إنا كل شيء خلقناه بقدر
en: Verily, all things have We created in proportion and measure.

source: وما أمرنا إلا واحدة كلمح بالبصر
en: And Our Command is but a single (Act),- like the twinkling of an eye.

source: ولقد أهلكنا أشياعكم فهل من مدكر
en: And (oft) in the past, have We destroyed gangs like unto you: then is there any that will receive admonition?

source: وكل شيء فعلوه في الزبر
en: All that they do is noted in (their) Books (of Deeds):

source: وكل صغير وكبير مستطر
en: Every matter, small and great, is on record.

source: إن المتقين في جنات ونهر
en: As to the Righteous, they will be in the midst of Gardens and Rivers,

source: في مقعد صدق عند مليك مقتدر
en: In an Assembly of Truth, in the Presence of a Sovereign Omnipotent.

source: الرحمن
en: (Allah) Most Gracious!

source: علم القرآن
en: It is He Who has taught the Qur'an.

source: خلق الإنسان
en: He has created man:

source: علمه البيان
en: He has taught him speech (and intelligence).

source: الشمس والقمر بحسبان
en: The sun and the moon follow courses (exactly) computed;

source: والنجم والشجر يسجدان
en: And the herbs and the trees - both (alike) prostrate in adoration.

source: والسماء رفعها ووضع الميزان
en: And the Firmament has He raised high, and He has set up the Balance (of Justice),

source: ألا تطغوا في الميزان
en: In order that ye may not transgress (due) balance.

source: وأقيموا الوزن بالقسط ولا تخسروا الميزان
en: So establish weight with justice and fall not short in the balance.

source: والأرض وضعها للأنام
en: It is He Who has spread out the earth for (His) creatures:

source: فيها فاكهة والنخل ذات الأكمام
en: Therein is fruit and date-palms, producing spathes (enclosing dates);

source: والحب ذو العصف والريحان
en: Also corn, with (its) leaves and stalk for fodder, and sweet-smelling plants.

source: فبأي آلاء ربكما تكذبان
en: Then which of the favours of your Lord will ye deny?

source: خلق الإنسان من صلصال كالفخار
en: He created man from sounding clay like unto pottery,

source: وخلق الجان من مارج من نار
en: And He created Jinns from fire free of smoke:

source: رب المشرقين ورب المغربين
en: (He is) Lord of the two Easts and Lord of the two Wests:

source: مرج البحرين يلتقيان
en: He has let free the two bodies of flowing water, meeting together:

source: بينهما برزخ لا يبغيان
en: Between them is a Barrier which they do not transgress:

source: يخرج منهما اللؤلؤ والمرجان
en: Out of them come Pearls and Coral:

source: وله الجوار المنشآت في البحر كالأعلام
en: And His are the Ships sailing smoothly through the seas, lofty as mountains:

source: كل من عليها فان
en: All that is on earth will perish:

source: ويبقى وجه ربك ذو الجلال والإكرام
en: But will abide (for ever) the Face of thy Lord,- full of Majesty, Bounty and Honour.

source: يسأله من في السماوات والأرض كل يوم هو في شأن
en: Of Him seeks (its need) every creature in the heavens and on earth: every day in (new) Splendour doth He (shine)!

source: سنفرغ لكم أيه الثقلان
en: Soon shall We settle your affairs, O both ye worlds!

source: يا معشر الجن والإنس إن استطعتم أن تنفذوا من أقطار السماوات والأرض فانفذوا لا تنفذون إلا بسلطان
en: O ye assembly of Jinns and men! If it be ye can pass beyond the zones of the heavens and the earth, pass ye! not without authority shall ye be able to pass!

source: يرسل عليكما شواظ من نار ونحاس فلا تنتصران
en: On you will be sent (O ye evil ones twain!) a flame of fire (to burn) and a smoke (to choke): no defence will ye have:

source: فإذا انشقت السماء فكانت وردة كالدهان
en: When the sky is rent asunder, and it becomes red like ointment:

source: فيومئذ لا يسأل عن ذنبه إنس ولا جان
en: On that Day no question will be asked of man or Jinn as to his sin.

source: يعرف المجرمون بسيماهم فيؤخذ بالنواصي والأقدام
en: (For) the sinners will be known by their marks: and they will be seized by their forelocks and their feet.

source: هذه جهنم التي يكذب بها المجرمون
en: This is the Hell which the Sinners deny:

source: يطوفون بينها وبين حميم آن
en: In its midst and in the midst of boiling hot water will they wander round!

source: ولمن خاف مقام ربه جنتان
en: But for such as fear the time when they will stand before (the Judgment Seat of) their Lord, there will be two Gardens-

source: ذواتا أفنان
en: Containing all kinds (of trees and delights);-

source: فيهما عينان تجريان
en: In them (each) will be two Springs flowing (free);

source: فيهما من كل فاكهة زوجان
en: In them will be Fruits of every kind, two and two.

source: متكئين على فرش بطائنها من إستبرق وجنى الجنتين دان
en: They will recline on Carpets, whose inner linings will be of rich brocade: the Fruit of the Gardens will be near (and easy of reach).

source: فيهن قاصرات الطرف لم يطمثهن إنس قبلهم ولا جان
en: In them will be (Maidens), chaste, restraining their glances, whom no man or Jinn before them has touched;-

source: كأنهن الياقوت والمرجان
en: Like unto Rubies and coral.

source: هل جزاء الإحسان إلا الإحسان
en: Is there any Reward for Good - other than Good?

source: ومن دونهما جنتان
en: And besides these two, there are two other Gardens,-

source: مدهامتان
en: Dark-green in colour (from plentiful watering).

source: فيهما عينان نضاختان
en: In them (each) will be two Springs pouring forth water in continuous abundance:

source: فيهما فاكهة ونخل ورمان
en: In them will be Fruits, and dates and pomegranates:

source: فيهن خيرات حسان
en: In them will be fair (Companions), good, beautiful;-

source: حور مقصورات في الخيام
en: Companions restrained (as to their glances), in (goodly) pavilions;-

source: لم يطمثهن إنس قبلهم ولا جان
en: Whom no man or Jinn before them has touched;-

source: متكئين على رفرف خضر وعبقري حسان
en: Reclining on green Cushions and rich Carpets of beauty.

source: تبارك اسم ربك ذي الجلال والإكرام
en: Blessed be the name of thy Lord, full of Majesty, Bounty and Honour.

source: إذا وقعت الواقعة
en: When the Event inevitable cometh to pass,

source: ليس لوقعتها كاذبة
en: Then will no (soul) entertain falsehood concerning its coming.

source: خافضة رافعة
en: (Many) will it bring low; (many) will it exalt;

source: إذا رجت الأرض رجا
en: When the earth shall be shaken to its depths,

source: وبست الجبال بسا
en: And the mountains shall be crumbled to atoms,

source: فكانت هباء منبثا
en: Becoming dust scattered abroad,

source: وكنتم أزواجا ثلاثة
en: And ye shall be sorted out into three classes.
